{
    "recipe": {
      "title": "Nut Butter and Jelly Pinwheels",
      "steps": {
        "0": "Gather Ingredients: Gather all of your ingredients and place them on a clean, dry surface like a cutting board or a large plate.",
        "1": "Place Tortilla: Lay a tortilla flat on a clean, dry surface like a cutting board or a large plate. Make sure the tortilla is room temperature for easier manipulation.",
        "2": "Scoop Butter: Use a butter knife to scoop a moderate amount of softened butter from its container. The amount will depend on your personal preference and the size of the tortilla..",
        "3": "Use a butter knife to scoop nut butter from the jar and spread it onto the tortilla, leaving a half-inch uncovered at the edges. Clean the knife by wiping with a paper towel afterward.",
        "4": "Scoop Jelly:With a separate spoon or knife, scoop your desired amount of jelly or jam.",
        "5": "Spread Jelly: Spread the jelly evenly over the butter layer, also avoiding the very edge of the tortilla to prevent spillage when rolling.",
        "6": "Clean Knife: Wipe the knife clean with a paper towel or wash it if needed. This ensures that there is no cross-contamination between the butter and jelly.",
        "7": "Roll Tortilla: Carefully roll the tortilla into a tight log, starting from one edge and working your way to the other.",
        "8": "Insert Toothpick: Insert toothpicks at even intervals along the rolled tortilla log. This helps to hold the roll together and will make slicing easier.",
        "9": "Trim Tortilla: If there are any uneven edges on the ends of the rolled tortilla, trim them off with a sharp knife to make a clean, neat log.",
        "10": "Slide Floss: Take a piece of unflavored dental floss and slide it under the rolled tortilla. Position the floss where you want to make a cut, cross the ends over the top of the roll, and pull through to slice. This method can yield cleaner cuts than using a knife.",
        "11": "Slice Tortilla: Continue to use the dental floss to slice the rolled tortilla into even pinwheels, or you can also use a sharp knife if you prefer.",
        "12": "Place Pinwheels: Arrange the sliced pinwheels neatly on a serving platter. They are now ready to be enjoyed immediately, or you can cover and refrigerate them for later use."
       }
    }
  }
  
